app/views/trips/_unfavorite.html.erb

<h4>You favorited <%= trip.name %></h4>
<%= form_for current_user.favorites.find_by(trip_id: trip.id), html: { method: :delete, class: "unfavorite-submit"} do |f| %>
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."trip_id" = $2 LIMIT 1  [["user_id", 22], ["trip_id", 1]]