app/views/trips/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."trip_id" = $1  [["trip_id", 1]]
---
      <h5>Comments by the Trip Creator:</h5>
      <% @trip.comments.each do |comment| %>

SELECT "locations".* FROM "locations" WHERE "locations"."trip_id" = $1  [["trip_id", 1]]
---

    $.ajax({
      url: window.location.href + '/locations.json'
    }).done( function( response ) {
      response.locations.map( function( location ) {
        var locationComponents = location.address.split( ' ' ).join( '+' )
        var contentString =
          '<div id="content">'+
            '<div id="siteNotice"></div>'+
            '<h5 id="firstHeading" class="firstHeading">'+
              location.name +
            '</h5>'+

            '<div id="bodyContent">'+
              '<p>'+ location.address +'</p>' +
              '<a href='+ 'https://www.google.com/maps/dir/Current+Location/' + locationComponents + ' target='+ '_blank' +'>Get Directions</a>'
            '</div>'+
          '</div>';

        var infowindow = new google.maps.InfoWindow({
          content: contentString
        });