app/views/users/show.html.erb

SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = $1  [["user_id", 22]]
SELECT COUNT(*) FROM "trips" WHERE "trips"."user_id" = $1  [["user_id", 22]]
---
              <p>Location: <%= @user.location %></p>
              <p>Trips Curated: <%= @user.trips.count %></p>

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 22]]
---
<h2>Favorites:</h2>
<% @user.favorites.each do |favorite| %>