localeyes/app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("user_id", "trip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 24], ["trip_id", 29], ["created_at", "2016-06-04 21:26:08.314233"], ["updated_at", "2016-06-04 21:26:08.314233"]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 29]]
---
  def create
    @favorite = Favorite.create(user_id: current_user.id, trip_id: params[:trip])
    @trip = Trip.find_by(id: params[:trip])

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT 1  [["id", 10]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 29]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 10]]
---
  def destroy
    @favorite = Favorite.find_by(id: params[:id])
    @trip = Trip.find_by(id: params[:trip_id])
    @favorite.destroy