localeyes/app/controllers/locations_controller.rb

  def index
    @trip = Trip.find_by(id: params[:trip_id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 26]]

  def create
    @location = Location.create(location_params)
    @trip = Trip.find_by(id: params[:trip_id])
    @trip.locations.push(@location)
---
INSERT INTO "locations" ("name", "address", "phone_number", "website_url", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 27]]
UPDATE "locations" SET "trip_id" = $1, "updated_at" = $2 WHERE "locations"."id" = $3  [["trip_id", 27], ["updated_at", "2016-06-04 17:20:30.077461"], ["id", 106]]

  def update
    @location = Location.find_by( id: params[ :id ] )
    @location.update_attributes( update_params )
    @trip = Trip.find_by( id: params[ :trip_id ] )
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", 107]]
UPDATE "locations" SET "personal_note" = $1, "duration" = $2, "updated_at" = $3 WHERE "locations"."id" = $4  [["personal_note", "wefw"], ["duration", 1], ["updated_at", "2016-06-04 18:49:36.233892"], ["id", 107]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 26]]

  def destroy
    @location = Location.find_by(id: params[:id])
    @location.destroy
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", 106]]
DELETE FROM "locations" WHERE "locations"."id" = $1  [["id", 106]]