localeyes/app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips"
---
def index
  @trips = Trip.all

INSERT INTO "trips" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "John's Trip"], ["user_id", 24], ["created_at", "2016-06-04 21:35:41.248471"], ["updated_at", "2016-06-04 21:35:41.248471"]]
INSERT INTO "trip_tags" ("trip_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["trip_id", 28], ["tag_id", 2], ["created_at", "2016-06-04 19:04:11.396976"], ["updated_at", "2016-06-04 19:04:11.396976"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT 1  [["name", "test"]]
SELECT "tags".* FROM "tags" INNER JOIN "trip_tags" ON "tags"."id" = "trip_tags"."tag_id" WHERE "trip_tags"."trip_id" = $1  [["trip_id", 27]]
DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 30]]
---
def create
  @trip = Trip.new(trip_params)
  @trip.creator = current_user
  tags = params[:trip][:tags].split(", ")
  if @trip.save
    tags.each do |tag|
      new_tag = Tag.find_or_create_by(name: tag)
      @trip.tags << new_tag
    end
    if @trip.tags.length < 1
      @trip.destroy

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 27]]
---
def show
  @trip = Trip.find_by(id: params[:id])