localeyes/app/controllers/welcome_controller.rb

SELECT "trips".* FROM "trips" WHERE "trips"."featured" = $1  [["featured", "t"]]
---
  def index
    @featured = Trip.where(featured: true)