app/controllers/trips_controller.rb

  def create
    @trip = Trip.new(trip_params)
    @trip.creator = current_user
    if params[ :trip ][ :tags ].include?( ", " )
      tags = params[ :trip ][ :tags ].split( ", " )
    else
      tags = params[ :trip ][ :tags ].split( " " )
    end
    tags = Tag.split_tags(params[ :trip ][ :tags ])

    if @trip.save
      tags.each do |tag|
        @trip.tags << Tag.find_create_tags(tag)
---
SELECT "tags".* FROM "tags" INNER JOIN "trip_tags" ON "tags"."id" = "trip_tags"."tag_id" WHERE "trip_tags"."trip_id" = $1  [["trip_id", 28]]
INSERT INTO "trips" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Brooklyn Beer Tour"], ["created_at", "2016-06-04 03:04:43.915445"], ["updated_at", "2016-06-04 03:04:43.915445"]]
INSERT INTO "trip_tags" ("trip_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["trip_id", 28], ["tag_id", 2], ["created_at", "2016-06-04 16:17:02.261602"], ["updated_at", "2016-06-04 16:17:02.261602"]]

  def show
    @trip = Trip.find_by( id: params[ :id ] )

    if @trip == nil
      redirect_to new_trip_path
    else
      @locations = @trip.locations
      @comment = Comment.new
      @creator_comments = @trip.creator_comments
      @user_comments = @trip.user_comments

      if @trip.locations.length < 3
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 22]]
SELECT "comments".* FROM "comments" WHERE "comments"."trip_id" = $1  [["trip_id", 1]]
SELECT "locations".* FROM "locations" WHERE "locations"."trip_id" = $1  [["trip_id", 1]]