app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips"
---
def index
  @trips = Trip.all

SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT 1  [["name", "fun"]]
---
def create
  @trip = Trip.new(trip_params)
  @trip.creator = current_user
  tags = params[:trip][:tags].split(", ")
  if @trip.save
    tags.each do |tag|
      new_tag = Tag.find_or_create_by(name: tag)