app/controllers/users_controller.rb

  def show
    @user = User.find_by( id: params[ :id ] )

    if !user_signed_in?
      redirect_to new_user_registration_path
    end
    # PANSAMPANSAM
    # Nothing below this comment should be in this method.
    # All of the logic below should be wrapped up in your user model
    # and called directly on @user in your view.

    @common_interests = []
    @common_trips = []

    tag_name = []

    @user.trips.each do | trip |
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 22]]
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = $1  [["user_id", 22]]