app/controllers/user_trips_controller.rb

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 1]]
---
  def create
    @trip = Trip.find( params[ :user_trip ][ :attended_trip_id ] )

SELECT  "user_trips".* FROM "user_trips" WHERE "user_trips"."id" = $1 LIMIT 1  [["id", 1]]
---
  def destroy
    @trip = UserTrip.find( params[ :id ] ).attended_trip