localeyes/app/views/trips/index.html.erb

SELECT "locations".* FROM "locations" WHERE "locations"."trip_id" = $1  [["trip_id", 6]]
---
            <span class="card-title"><%=trip.name%></span>
            <% trip.locations.each do |location|%>

SELECT "tags".* FROM "tags" INNER JOIN "trip_tags" ON "tags"."id" = "trip_tags"."tag_id" WHERE "trip_tags"."trip_id" = $1  [["trip_id", 1]]
SELECT COUNT(*) FROM "tags" INNER JOIN "trip_tags" ON "tags"."id" = "trip_tags"."tag_id" WHERE "trip_tags"."trip_id" = $1  [["trip_id", 6]]
---
            <span>Created by: <%= link_to trip.creator.formatted_name %></a>
              <% if trip.tags.count > 0 %>